ЧартерEDT.Расширение1/src/Reports/RoomInventory/RoomInventory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7b818758-be13-41e3-8b4d-958a26ded709">
  <name>RoomInventory</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Report>

ЧартерEDT.Расширение1/src/AccumulationRegisters/RoomInventory/RoomInventory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="aeb81e75-04ad-4f43-868f-b8ea2669c5d7">
  <name>RoomInventory</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="7187f02a-e01a-4fa4-a90d-ed9ace802a97">
    <name>Counter</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c26c8823-5255-4588-91ab-3f27f6c31ff5">
    <name>TotalRooms</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="78098442-cc9e-4761-848d-af64c2f5109f">
    <name>TotalBeds</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="357a8f84-1ec8-4df6-9544-5f74d86b72dc">
    <name>RoomsBlocked</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="22789c75-f8a9-477f-9281-68c367895c20">
    <name>BedsBlocked</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bd1ad0c3-3520-47a2-bdf8-f2fef29a4b16">
    <name>ExpectedRoomsCheckedOut</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="62777090-ae79-44c3-adca-787e958cc1e8">
    <name>ExpectedBedsCheckedOut</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="971c16cd-9b59-45e8-819e-a9a3c7e36f30">
    <name>ExpectedGuestsCheckedOut</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c1a65555-7280-42d8-953d-4784a4163e9f">
    <name>GuestsReserved</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="0f95b9b2-b56a-4639-a4f1-fca810dc2b4c">
    <name>RoomsReserved</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5d6674d8-44b4-44fb-b651-3f701f20e111">
    <name>RoomsVacant</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c4b4557e-9287-41d4-8e59-2df23edb9117">
    <name>BedsVacant</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="ecdde1f9-5cf0-450e-9c85-240a41e21dc3">
    <name>IsInHouse</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2dd1591-19cc-42df-853b-928c89fabd9b">
    <name>IsAccommodation</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0bee4da2-3939-441c-b5f7-b1232729f041">
    <name>PeriodFrom</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8b252a75-9287-4325-a6cb-0a88bdce9ca2">
    <name>PeriodTo</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="46d7e314-d052-46d5-8347-a165acef5625">
    <name>Customer</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95181482-afb2-4654-9864-0ec98c2b823d">
    <name>GuestGroup</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="31da10c9-481a-48a5-ac2c-46a0315d7a6f">
    <name>Guest</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9ecc1c4-80e9-4cf0-8d39-e9e904be978a">
    <name>CheckOutDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dda37713-d4e8-4591-886d-de3bfbcc0dad">
    <name>NumberOfPersons</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b999d1f7-084e-4966-935f-e9425a773bad">
    <name>IsCheckOut</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad21bcb0-f275-4cd5-aaa9-b4f0ac09f5e1">
    <name>IsReservation</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="daff9aed-b7c8-4664-8fc9-8434ccd4dcad">
    <name>CheckInDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="efee26ee-0b75-4a40-80b3-1cef1c5a4ba0">
    <name>RoomQuota</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="860bbeda-97f5-4e71-9843-8c52beecca35">
    <name>Room</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0f7bef0b-3f02-45bd-bf04-1f07ad0da4e1">
    <name>Hotel</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="187fbf66-3954-47d0-8c0f-925b11f74ee2">
    <name>RoomType</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ЧартерEDT.Расширение1/src/AccumulationRegisters/RoomBlocks/RoomBlocks.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d3016e1f-0c5b-4bcb-a6f9-e83a7b47ea59">
  <name>RoomBlocks</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a9ebc60-27f9-4699-b7db-a0da3459d364">
    <name>RoomsBlocked</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="2fbb3bcb-39ec-4e39-9f9a-5dcccab30606">
    <name>BedsBlocked</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="3348b6c4-9547-468d-b112-998b471ddaef">
    <name>Room</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="092aa426-482f-408d-9f09-340605d9cd1c">
    <name>Hotel</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="5a5de2c1-e305-445f-be43-8d475e8acc9d">
    <name>RoomBlockType</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ЧартерEDT.Расширение1/src/AccumulationRegisters/RoomQuotaSales/RoomQuotaSales.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="05b0fed3-0331-47cc-8196-b33bb9d7181c">
  <name>RoomQuotaSales</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="49a26b39-49c9-42a9-bc90-ac5f315c744f">
    <name>Counter</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c876c95e-2b0f-4268-8174-63f572028297">
    <name>RoomsInQuota</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="2887f687-0abc-4be6-bf81-b7ce91f80e06">
    <name>BedsInQuota</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5c42be62-5678-4996-90ed-f97cf63187d2">
    <name>RoomsRemains</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="0ebe7917-b9ce-40a9-b303-f86a2b997755">
    <name>BedsRemains</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="8eb5272f-3e85-419f-92f3-6d6bcd969e95">
    <name>Room</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="bf98c769-4c9f-4099-b007-41c04249491f">
    <name>RoomType</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4a2c9738-c8d9-49ad-9abe-300e76ea86f9">
    <name>Hotel</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="bc86eeca-db08-4412-9fba-c50999e0a116">
    <name>RoomQuota</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ЧартерEDT.Расширение1/src/Reports/RoomInventory/ObjectModule.bsl
&ChangeAndValidate("pmInitializeReportBuilder")
Procedure Расш1_pmInitializeReportBuilder()
	ReportBuilder = New ReportBuilder();
	
	#Вставка
		QueryText = 
	"SELECT Разрешенные
	|	RoomInventoryMovements.Recorder AS Recorder,
	|	MAX(RoomInventoryMovements.Period) AS PeriodFrom
	|INTO EffectivePeriodsByRecorders
	|FROM
	|	AccumulationRegister.RoomInventory AS RoomInventoryMovements
	|WHERE
	|	RoomInventoryMovements.RecordType = VALUE(AccumulationRecordType.Expense)
	|	AND RoomInventoryMovements.Period <= &qPeriodTo
	|	AND RoomInventoryMovements.PeriodFrom <= &qPeriodTo
	|	AND RoomInventoryMovements.PeriodTo > &qPeriodTo
	|	AND (RoomInventoryMovements.IsReservation
	|			OR RoomInventoryMovements.IsAccommodation)
	|	AND (RoomInventoryMovements.Hotel IN HIERARCHY (&qHotel)
	|			OR &qIsEmptyHotel)
	|	AND (RoomInventoryMovements.Room IN HIERARCHY (&qRoom)
	|			OR &qIsEmptyRoom)
	|	AND (RoomInventoryMovements.RoomQuota IN HIERARCHY (&qRoomQuota)
	|			OR &qIsEmptyRoomQuota)
	|	AND (RoomInventoryMovements.RoomType IN HIERARCHY (&qRoomType)
	|			OR &qIsEmptyRoomType)
	|
	|GROUP BY
	|	RoomInventoryMovements.Recorder
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT Разрешенные
	|	RoomInventory.Hotel AS Hotel,
	|	RoomInventory.Status AS Status,
	|	RoomInventory.Room AS Room,
	|	RoomInventory.Customer AS Customer,
	|	RoomInventory.Contract AS Contract,
	|	RoomInventory.GuestGroup AS GuestGroup,
	|	RoomInventory.Guest AS Guest,
	|	RoomInventory.CheckInDate AS CheckInDate,
	|	RoomInventory.Duration AS Duration,
	|	RoomInventory.CheckOutDate AS CheckOutDate,
	|	RoomInventory.RoomType AS RoomType,
	|	RoomInventory.AccommodationType AS AccommodationType,
	|	RoomInventory.RoomQuota AS RoomQuota,
	|	RoomInventory.Remarks AS Remarks,
	|	RoomInventory.Recorder AS Recorder,
	|	RoomInventory.IsRoomInventory AS IsRoomInventory,
	|	RoomInventory.IsBlocking AS IsBlocking,
	|	RoomInventory.IsRoomQuota AS IsRoomQuota,
	|	RoomInventory.IsReservation AS IsReservation,
	|	RoomInventory.IsAccommodation AS IsAccommodation,
	|	RoomInventory.RoomsVacant AS RoomsVacant,
	|	RoomInventory.BedsVacant AS BedsVacant
	|{SELECT
	|	Hotel.*,
	|	Recorder.*,
	|	Status.*,
	|	Room.*,
	|	Customer.*,
	|	Contract.*,
	|	GuestGroup.*,
	|	Guest.*,
	|	CheckInDate,
	|	Duration,
	|	CheckOutDate,
	|	RoomType.*,
	|	AccommodationType.*,
	|	RoomQuota.*,
	|	Remarks,
	|	IsRoomInventory,
	|	IsBlocking,
	|	IsRoomQuota,
	|	IsReservation,
	|	IsAccommodation,
	|	RoomsVacant,
	|	BedsVacant}
	|FROM
	|	(SELECT DISTINCT
	|		RoomInventoryMovements.Hotel AS Hotel,
	|		RoomInventoryMovements.Status AS Status,
	|		RoomInventoryMovements.Room AS Room,
	|		RoomInventoryMovements.Customer AS Customer,
	|		RoomInventoryMovements.Contract AS Contract,
	|		RoomInventoryMovements.GuestGroup AS GuestGroup,
	|		RoomInventoryMovements.Guest AS Guest,
	|		RoomInventoryMovements.CheckInDate AS CheckInDate,
	|		RoomInventoryMovements.Duration AS Duration,
	|		RoomInventoryMovements.CheckOutDate AS CheckOutDate,
	|		RoomInventoryMovements.RoomType AS RoomType,
	|		RoomInventoryMovements.AccommodationType AS AccommodationType,
	|		RoomInventoryMovements.RoomQuota AS RoomQuota,
	|		CAST(RoomInventoryMovements.Remarks AS STRING(1024)) AS Remarks,
	|		RoomInventoryMovements.Recorder AS Recorder,
	|		RoomInventoryMovements.IsRoomInventory AS IsRoomInventory,
	|		RoomInventoryMovements.IsBlocking AS IsBlocking,
	|		RoomInventoryMovements.IsRoomQuota AS IsRoomQuota,
	|		RoomInventoryMovements.IsReservation AS IsReservation,
	|		RoomInventoryMovements.IsAccommodation AS IsAccommodation,
	|		RoomInventoryMovements.RoomsVacant AS RoomsVacant,
	|		RoomInventoryMovements.BedsVacant AS BedsVacant
	|	FROM
	|		(SELECT
	|			AvailableRooms.Hotel AS Hotel,
	|			NULL AS Status,
	|			NULL AS Room,
	|			NULL AS Customer,
	|			NULL AS Contract,
	|			NULL AS GuestGroup,
	|			NULL AS Guest,
	|			NULL AS CheckInDate,
	|			NULL AS Duration,
	|			NULL AS CheckOutDate,
	|			NULL AS RoomType,
	|			NULL AS AccommodationType,
	|			NULL AS RoomQuota,
	|			NULL AS Remarks,
	|			NULL AS Recorder,
	|			TRUE AS IsRoomInventory,
	|			FALSE AS IsBlocking,
	|			FALSE AS IsRoomQuota,
	|			FALSE AS IsReservation,
	|			FALSE AS IsAccommodation,
	|			ISNULL(AvailableRooms.TotalRoomsBalance, 0) AS RoomsVacant,
	|			ISNULL(AvailableRooms.TotalBedsBalance, 0) AS BedsVacant
	|		FROM
	|			AccumulationRegister.RoomInventory.Balance(
	|					&qPeriodTo,
	|					&qIsEmptyRoomQuota
	|						AND (Hotel IN HIERARCHY (&qHotel)
	|							OR &qIsEmptyHotel)
	|						AND (Room IN HIERARCHY (&qRoom)
	|							OR &qIsEmptyRoom)
	|						AND (RoomType IN HIERARCHY (&qRoomType)
	|							OR &qIsEmptyRoomType)) AS AvailableRooms
	|		
	|		UNION ALL
	|		
	|		SELECT
	|			RoomBlocks.Hotel,
	|			RoomBlocks.RoomBlockType,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			FALSE,
	|			TRUE,
	|			FALSE,
	|			FALSE,
	|			FALSE,
	|			-ISNULL(RoomBlocks.RoomsBlockedBalance, 0),
	|			-ISNULL(RoomBlocks.BedsBlockedBalance, 0)
	|		FROM
	|			AccumulationRegister.RoomBlocks.Balance(
	|					&qPeriodTo,
	|					&qIsEmptyRoomQuota
	|						AND (Hotel IN HIERARCHY (&qHotel)
	|							OR &qIsEmptyHotel)
	|						AND (Room IN HIERARCHY (&qRoom)
	|							OR &qIsEmptyRoom)
	|						AND (RoomType IN HIERARCHY (&qRoomType)
	|							OR &qIsEmptyRoomType)) AS RoomBlocks
	|		
	|		UNION ALL
	|		
	|		SELECT
	|			RoomQuotas.Hotel,
	|			RoomQuotas.RoomQuota,
	|			NULL,
	|			RoomQuotas.RoomQuota.Customer,
	|			RoomQuotas.RoomQuota.Contract,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			RoomQuotas.RoomQuota,
	|			NULL,
	|			NULL,
	|			FALSE,
	|			FALSE,
	|			TRUE,
	|			FALSE,
	|			FALSE,
	|			-ISNULL(RoomQuotas.RoomsRemainsBalance, 0),
	|			-ISNULL(RoomQuotas.BedsRemainsBalance, 0)
	|		FROM
	|			AccumulationRegister.RoomQuotaSales.Balance(
	|					&qPeriodTo,
	|					RoomQuota.DoWriteOff
	|						AND (Hotel IN HIERARCHY (&qHotel)
	|							OR &qIsEmptyHotel)
	|						AND (RoomQuota IN HIERARCHY (&qRoomQuota)
	|							OR &qIsEmptyRoomQuota)
	|						AND (Room IN HIERARCHY (&qRoom)
	|							OR &qIsEmptyRoom)
	|						AND (RoomType IN HIERARCHY (&qRoomType)
	|							OR &qIsEmptyRoomType)) AS RoomQuotas
	|		
	|		UNION ALL
	|		
	|		SELECT
	|			Reservations.Hotel,
	|			Reservations.ReservationStatus,
	|			Reservations.Room,
	|			Reservations.Customer,
	|			Reservations.Contract,
	|			Reservations.GuestGroup,
	|			Reservations.Guest,
	|			Reservations.PeriodFrom,
	|			Reservations.PeriodDuration,
	|			Reservations.PeriodTo,
	|			Reservations.RoomType,
	|			Reservations.AccommodationType,
	|			Reservations.RoomQuota,
	|			Reservations.Remarks,
	|			Reservations.Recorder,
	|			FALSE,
	|			FALSE,
	|			FALSE,
	|			TRUE,
	|			FALSE,
	|			-Reservations.RoomsVacant,
	|			-Reservations.BedsVacant
	|		FROM
	|			AccumulationRegister.RoomInventory AS Reservations
	|				INNER JOIN EffectivePeriodsByRecorders AS EffectivePeriodsByRecorders
	|				ON Reservations.Recorder = EffectivePeriodsByRecorders.Recorder
	|					AND Reservations.Period = EffectivePeriodsByRecorders.PeriodFrom
	|		WHERE
	|			Reservations.RecordType = VALUE(AccumulationRecordType.Expense)
	|			AND Reservations.IsReservation
	|			AND (Reservations.Hotel IN HIERARCHY (&qHotel)
	|					OR &qIsEmptyHotel)
	|			AND (Reservations.Room IN HIERARCHY (&qRoom)
	|					OR &qIsEmptyRoom)
	|			AND (Reservations.RoomQuota IN HIERARCHY (&qRoomQuota)
	|					OR &qIsEmptyRoomQuota)
	|			AND (Reservations.RoomType IN HIERARCHY (&qRoomType)
	|					OR &qIsEmptyRoomType)
	|		
	|		UNION ALL
	|		
	|		SELECT
	|			Accommodations.Hotel,
	|			Accommodations.AccommodationStatus,
	|			Accommodations.Room,
	|			Accommodations.Customer,
	|			Accommodations.Contract,
	|			Accommodations.GuestGroup,
	|			Accommodations.Guest,
	|			Accommodations.PeriodFrom,
	|			Accommodations.PeriodDuration,
	|			Accommodations.PeriodTo,
	|			Accommodations.RoomType,
	|			Accommodations.AccommodationType,
	|			Accommodations.RoomQuota,
	|			Accommodations.Remarks,
	|			Accommodations.Recorder,
	|			FALSE,
	|			FALSE,
	|			FALSE,
	|			FALSE,
	|			TRUE,
	|			-Accommodations.RoomsVacant,
	|			-Accommodations.BedsVacant
	|		FROM
	|			AccumulationRegister.RoomInventory AS Accommodations
	|				INNER JOIN EffectivePeriodsByRecorders AS EffectivePeriodsByRecorders
	|				ON Accommodations.Recorder = EffectivePeriodsByRecorders.Recorder
	|					AND Accommodations.Period = EffectivePeriodsByRecorders.PeriodFrom
	|		WHERE
	|			Accommodations.RecordType = VALUE(AccumulationRecordType.Expense)
	|			AND Accommodations.IsAccommodation
	|			AND (Accommodations.Hotel IN HIERARCHY (&qHotel)
	|					OR &qIsEmptyHotel)
	|			AND (Accommodations.Room IN HIERARCHY (&qRoom)
	|					OR &qIsEmptyRoom)
	|			AND (Accommodations.RoomQuota IN HIERARCHY (&qRoomQuota)
	|					OR &qIsEmptyRoomQuota)
	|			AND (Accommodations.RoomType IN HIERARCHY (&qRoomType)
	|					OR &qIsEmptyRoomType)) AS RoomInventoryMovements) AS RoomInventory
	|{WHERE
	|	RoomInventory.Hotel.*,
	|	RoomInventory.Status.*,
	|	RoomInventory.Room.*,
	|	RoomInventory.Customer.*,
	|	RoomInventory.Contract.*,
	|	RoomInventory.GuestGroup.*,
	|	RoomInventory.Guest.*,
	|	RoomInventory.CheckInDate,
	|	RoomInventory.Duration,
	|	RoomInventory.CheckOutDate,
	|	RoomInventory.RoomType.*,
	|	RoomInventory.AccommodationType.*,
	|	RoomInventory.RoomQuota.*,
	|	RoomInventory.Remarks,
	|	RoomInventory.Recorder.*,
	|	RoomInventory.IsRoomInventory,
	|	RoomInventory.IsBlocking,
	|	RoomInventory.IsRoomQuota,
	|	RoomInventory.IsReservation,
	|	RoomInventory.IsAccommodation,
	|	RoomInventory.RoomsVacant,
	|	RoomInventory.BedsVacant}
	|
	|ORDER BY
	|	Hotel,
	|	IsRoomInventory DESC,
	|	IsBlocking DESC,
	|	IsRoomQuota DESC,
	|	IsReservation DESC,
	|	IsAccommodation DESC,
	|	Customer,
	|	Room,
	|	CheckInDate,
	|	Guest
	|{ORDER BY
	|	Hotel.*,
	|	Status.*,
	|	Room.*,
	|	Customer.*,
	|	Contract.*,
	|	GuestGroup.*,
	|	Guest.*,
	|	CheckInDate,
	|	Duration,
	|	CheckOutDate,
	|	RoomType.*,
	|	AccommodationType.*,
	|	RoomQuota.*,
	|	Remarks,
	|	Recorder.*,
	|	IsRoomInventory,
	|	IsBlocking,
	|	IsRoomQuota,
	|	IsReservation,
	|	IsAccommodation,
	|	RoomsVacant,
	|	BedsVacant}
	|TOTALS
	|	SUM(RoomsVacant),
	|	SUM(BedsVacant)
	|BY
	|	OVERALL,
	|	Customer
	|{TOTALS BY
	|	Hotel.*,
	|	Status.*,
	|	Room.*,
	|	Customer.*,
	|	Contract.*,
	|	GuestGroup.*,
	|	Guest.*,
	|	RoomType.*,
	|	RoomQuota.*,
	|	Recorder.*,
	|	IsRoomInventory,
	|	IsBlocking,
	|	IsRoomQuota,
	|	IsReservation,
	|	IsAccommodation}";
	#КонецВставки
	
	// Initialize default query text
	#Удаление
	QueryText = 
	"SELECT
	|	RoomInventoryMovements.Recorder AS Recorder,
	|	MAX(RoomInventoryMovements.Period) AS PeriodFrom
	|INTO EffectivePeriodsByRecorders
	|FROM
	|	AccumulationRegister.RoomInventory AS RoomInventoryMovements
	|WHERE
	|	RoomInventoryMovements.RecordType = VALUE(AccumulationRecordType.Expense)
	|	AND RoomInventoryMovements.Period <= &qPeriodTo
	|	AND RoomInventoryMovements.PeriodFrom <= &qPeriodTo
	|	AND RoomInventoryMovements.PeriodTo > &qPeriodTo
	|	AND (RoomInventoryMovements.IsReservation
	|			OR RoomInventoryMovements.IsAccommodation)
	|	AND (RoomInventoryMovements.Hotel IN HIERARCHY (&qHotel)
	|			OR &qIsEmptyHotel)
	|	AND (RoomInventoryMovements.Room IN HIERARCHY (&qRoom)
	|			OR &qIsEmptyRoom)
	|	AND (RoomInventoryMovements.RoomQuota IN HIERARCHY (&qRoomQuota)
	|			OR &qIsEmptyRoomQuota)
	|	AND (RoomInventoryMovements.RoomType IN HIERARCHY (&qRoomType)
	|			OR &qIsEmptyRoomType)
	|
	|GROUP BY
	|	RoomInventoryMovements.Recorder
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	RoomInventory.Hotel AS Hotel,
	|	RoomInventory.Status AS Status,
	|	RoomInventory.Room AS Room,
	|	RoomInventory.Customer AS Customer,
	|	RoomInventory.Contract AS Contract,
	|	RoomInventory.GuestGroup AS GuestGroup,
	|	RoomInventory.Guest AS Guest,
	|	RoomInventory.CheckInDate AS CheckInDate,
	|	RoomInventory.Duration AS Duration,
	|	RoomInventory.CheckOutDate AS CheckOutDate,
	|	RoomInventory.RoomType AS RoomType,
	|	RoomInventory.AccommodationType AS AccommodationType,
	|	RoomInventory.RoomQuota AS RoomQuota,
	|	RoomInventory.Remarks AS Remarks,
	|	RoomInventory.Recorder AS Recorder,
	|	RoomInventory.IsRoomInventory AS IsRoomInventory,
	|	RoomInventory.IsBlocking AS IsBlocking,
	|	RoomInventory.IsRoomQuota AS IsRoomQuota,
	|	RoomInventory.IsReservation AS IsReservation,
	|	RoomInventory.IsAccommodation AS IsAccommodation,
	|	RoomInventory.RoomsVacant AS RoomsVacant,
	|	RoomInventory.BedsVacant AS BedsVacant
	|{SELECT
	|	Hotel.*,
	|	Recorder.*,
	|	Status.*,
	|	Room.*,
	|	Customer.*,
	|	Contract.*,
	|	GuestGroup.*,
	|	Guest.*,
	|	CheckInDate,
	|	Duration,
	|	CheckOutDate,
	|	RoomType.*,
	|	AccommodationType.*,
	|	RoomQuota.*,
	|	Remarks,
	|	IsRoomInventory,
	|	IsBlocking,
	|	IsRoomQuota,
	|	IsReservation,
	|	IsAccommodation,
	|	RoomsVacant,
	|	BedsVacant}
	|FROM
	|	(SELECT DISTINCT
	|		RoomInventoryMovements.Hotel AS Hotel,
	|		RoomInventoryMovements.Status AS Status,
	|		RoomInventoryMovements.Room AS Room,
	|		RoomInventoryMovements.Customer AS Customer,
	|		RoomInventoryMovements.Contract AS Contract,
	|		RoomInventoryMovements.GuestGroup AS GuestGroup,
	|		RoomInventoryMovements.Guest AS Guest,
	|		RoomInventoryMovements.CheckInDate AS CheckInDate,
	|		RoomInventoryMovements.Duration AS Duration,
	|		RoomInventoryMovements.CheckOutDate AS CheckOutDate,
	|		RoomInventoryMovements.RoomType AS RoomType,
	|		RoomInventoryMovements.AccommodationType AS AccommodationType,
	|		RoomInventoryMovements.RoomQuota AS RoomQuota,
	|		CAST(RoomInventoryMovements.Remarks AS STRING(1024)) AS Remarks,
	|		RoomInventoryMovements.Recorder AS Recorder,
	|		RoomInventoryMovements.IsRoomInventory AS IsRoomInventory,
	|		RoomInventoryMovements.IsBlocking AS IsBlocking,
	|		RoomInventoryMovements.IsRoomQuota AS IsRoomQuota,
	|		RoomInventoryMovements.IsReservation AS IsReservation,
	|		RoomInventoryMovements.IsAccommodation AS IsAccommodation,
	|		RoomInventoryMovements.RoomsVacant AS RoomsVacant,
	|		RoomInventoryMovements.BedsVacant AS BedsVacant
	|	FROM
	|		(SELECT
	|			AvailableRooms.Hotel AS Hotel,
	|			NULL AS Status,
	|			NULL AS Room,
	|			NULL AS Customer,
	|			NULL AS Contract,
	|			NULL AS GuestGroup,
	|			NULL AS Guest,
	|			NULL AS CheckInDate,
	|			NULL AS Duration,
	|			NULL AS CheckOutDate,
	|			NULL AS RoomType,
	|			NULL AS AccommodationType,
	|			NULL AS RoomQuota,
	|			NULL AS Remarks,
	|			NULL AS Recorder,
	|			TRUE AS IsRoomInventory,
	|			FALSE AS IsBlocking,
	|			FALSE AS IsRoomQuota,
	|			FALSE AS IsReservation,
	|			FALSE AS IsAccommodation,
	|			ISNULL(AvailableRooms.TotalRoomsBalance, 0) AS RoomsVacant,
	|			ISNULL(AvailableRooms.TotalBedsBalance, 0) AS BedsVacant
	|		FROM
	|			AccumulationRegister.RoomInventory.Balance(
	|					&qPeriodTo,
	|					&qIsEmptyRoomQuota
	|						AND (Hotel IN HIERARCHY (&qHotel)
	|							OR &qIsEmptyHotel)
	|						AND (Room IN HIERARCHY (&qRoom)
	|							OR &qIsEmptyRoom)
	|						AND (RoomType IN HIERARCHY (&qRoomType)
	|							OR &qIsEmptyRoomType)) AS AvailableRooms
	|		
	|		UNION ALL
	|		
	|		SELECT
	|			RoomBlocks.Hotel,
	|			RoomBlocks.RoomBlockType,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			FALSE,
	|			TRUE,
	|			FALSE,
	|			FALSE,
	|			FALSE,
	|			-ISNULL(RoomBlocks.RoomsBlockedBalance, 0),
	|			-ISNULL(RoomBlocks.BedsBlockedBalance, 0)
	|		FROM
	|			AccumulationRegister.RoomBlocks.Balance(
	|					&qPeriodTo,
	|					&qIsEmptyRoomQuota
	|						AND (Hotel IN HIERARCHY (&qHotel)
	|							OR &qIsEmptyHotel)
	|						AND (Room IN HIERARCHY (&qRoom)
	|							OR &qIsEmptyRoom)
	|						AND (RoomType IN HIERARCHY (&qRoomType)
	|							OR &qIsEmptyRoomType)) AS RoomBlocks
	|		
	|		UNION ALL
	|		
	|		SELECT
	|			RoomQuotas.Hotel,
	|			RoomQuotas.RoomQuota,
	|			NULL,
	|			RoomQuotas.RoomQuota.Customer,
	|			RoomQuotas.RoomQuota.Contract,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			RoomQuotas.RoomQuota,
	|			NULL,
	|			NULL,
	|			FALSE,
	|			FALSE,
	|			TRUE,
	|			FALSE,
	|			FALSE,
	|			-ISNULL(RoomQuotas.RoomsRemainsBalance, 0),
	|			-ISNULL(RoomQuotas.BedsRemainsBalance, 0)
	|		FROM
	|			AccumulationRegister.RoomQuotaSales.Balance(
	|					&qPeriodTo,
	|					RoomQuota.DoWriteOff
	|						AND (Hotel IN HIERARCHY (&qHotel)
	|							OR &qIsEmptyHotel)
	|						AND (RoomQuota IN HIERARCHY (&qRoomQuota)
	|							OR &qIsEmptyRoomQuota)
	|						AND (Room IN HIERARCHY (&qRoom)
	|							OR &qIsEmptyRoom)
	|						AND (RoomType IN HIERARCHY (&qRoomType)
	|							OR &qIsEmptyRoomType)) AS RoomQuotas
	|		
	|		UNION ALL
	|		
	|		SELECT
	|			Reservations.Hotel,
	|			Reservations.ReservationStatus,
	|			Reservations.Room,
	|			Reservations.Customer,
	|			Reservations.Contract,
	|			Reservations.GuestGroup,
	|			Reservations.Guest,
	|			Reservations.PeriodFrom,
	|			Reservations.PeriodDuration,
	|			Reservations.PeriodTo,
	|			Reservations.RoomType,
	|			Reservations.AccommodationType,
	|			Reservations.RoomQuota,
	|			Reservations.Remarks,
	|			Reservations.Recorder,
	|			FALSE,
	|			FALSE,
	|			FALSE,
	|			TRUE,
	|			FALSE,
	|			-Reservations.RoomsVacant,
	|			-Reservations.BedsVacant
	|		FROM
	|			AccumulationRegister.RoomInventory AS Reservations
	|				INNER JOIN EffectivePeriodsByRecorders AS EffectivePeriodsByRecorders
	|				ON Reservations.Recorder = EffectivePeriodsByRecorders.Recorder
	|					AND Reservations.Period = EffectivePeriodsByRecorders.PeriodFrom
	|		WHERE
	|			Reservations.RecordType = VALUE(AccumulationRecordType.Expense)
	|			AND Reservations.IsReservation
	|			AND (Reservations.Hotel IN HIERARCHY (&qHotel)
	|					OR &qIsEmptyHotel)
	|			AND (Reservations.Room IN HIERARCHY (&qRoom)
	|					OR &qIsEmptyRoom)
	|			AND (Reservations.RoomQuota IN HIERARCHY (&qRoomQuota)
	|					OR &qIsEmptyRoomQuota)
	|			AND (Reservations.RoomType IN HIERARCHY (&qRoomType)
	|					OR &qIsEmptyRoomType)
	|		
	|		UNION ALL
	|		
	|		SELECT
	|			Accommodations.Hotel,
	|			Accommodations.AccommodationStatus,
	|			Accommodations.Room,
	|			Accommodations.Customer,
	|			Accommodations.Contract,
	|			Accommodations.GuestGroup,
	|			Accommodations.Guest,
	|			Accommodations.PeriodFrom,
	|			Accommodations.PeriodDuration,
	|			Accommodations.PeriodTo,
	|			Accommodations.RoomType,
	|			Accommodations.AccommodationType,
	|			Accommodations.RoomQuota,
	|			Accommodations.Remarks,
	|			Accommodations.Recorder,
	|			FALSE,
	|			FALSE,
	|			FALSE,
	|			FALSE,
	|			TRUE,
	|			-Accommodations.RoomsVacant,
	|			-Accommodations.BedsVacant
	|		FROM
	|			AccumulationRegister.RoomInventory AS Accommodations
	|				INNER JOIN EffectivePeriodsByRecorders AS EffectivePeriodsByRecorders
	|				ON Accommodations.Recorder = EffectivePeriodsByRecorders.Recorder
	|					AND Accommodations.Period = EffectivePeriodsByRecorders.PeriodFrom
	|		WHERE
	|			Accommodations.RecordType = VALUE(AccumulationRecordType.Expense)
	|			AND Accommodations.IsAccommodation
	|			AND (Accommodations.Hotel IN HIERARCHY (&qHotel)
	|					OR &qIsEmptyHotel)
	|			AND (Accommodations.Room IN HIERARCHY (&qRoom)
	|					OR &qIsEmptyRoom)
	|			AND (Accommodations.RoomQuota IN HIERARCHY (&qRoomQuota)
	|					OR &qIsEmptyRoomQuota)
	|			AND (Accommodations.RoomType IN HIERARCHY (&qRoomType)
	|					OR &qIsEmptyRoomType)) AS RoomInventoryMovements) AS RoomInventory
	|{WHERE
	|	RoomInventory.Hotel.*,
	|	RoomInventory.Status.*,
	|	RoomInventory.Room.*,
	|	RoomInventory.Customer.*,
	|	RoomInventory.Contract.*,
	|	RoomInventory.GuestGroup.*,
	|	RoomInventory.Guest.*,
	|	RoomInventory.CheckInDate,
	|	RoomInventory.Duration,
	|	RoomInventory.CheckOutDate,
	|	RoomInventory.RoomType.*,
	|	RoomInventory.AccommodationType.*,
	|	RoomInventory.RoomQuota.*,
	|	RoomInventory.Remarks,
	|	RoomInventory.Recorder.*,
	|	RoomInventory.IsRoomInventory,
	|	RoomInventory.IsBlocking,
	|	RoomInventory.IsRoomQuota,
	|	RoomInventory.IsReservation,
	|	RoomInventory.IsAccommodation,
	|	RoomInventory.RoomsVacant,
	|	RoomInventory.BedsVacant}
	|
	|ORDER BY
	|	Hotel,
	|	IsRoomInventory DESC,
	|	IsBlocking DESC,
	|	IsRoomQuota DESC,
	|	IsReservation DESC,
	|	IsAccommodation DESC,
	|	Customer,
	|	Room,
	|	CheckInDate,
	|	Guest
	|{ORDER BY
	|	Hotel.*,
	|	Status.*,
	|	Room.*,
	|	Customer.*,
	|	Contract.*,
	|	GuestGroup.*,
	|	Guest.*,
	|	CheckInDate,
	|	Duration,
	|	CheckOutDate,
	|	RoomType.*,
	|	AccommodationType.*,
	|	RoomQuota.*,
	|	Remarks,
	|	Recorder.*,
	|	IsRoomInventory,
	|	IsBlocking,
	|	IsRoomQuota,
	|	IsReservation,
	|	IsAccommodation,
	|	RoomsVacant,
	|	BedsVacant}
	|TOTALS
	|	SUM(RoomsVacant),
	|	SUM(BedsVacant)
	|BY
	|	OVERALL,
	|	Customer
	|{TOTALS BY
	|	Hotel.*,
	|	Status.*,
	|	Room.*,
	|	Customer.*,
	|	Contract.*,
	|	GuestGroup.*,
	|	Guest.*,
	|	RoomType.*,
	|	RoomQuota.*,
	|	Recorder.*,
	|	IsRoomInventory,
	|	IsBlocking,
	|	IsRoomQuota,
	|	IsReservation,
	|	IsAccommodation}";
	#КонецУдаления
	ReportBuilder.Text = QueryText;
	ReportBuilder.FillSettings();
	// Initialize report builder with default query
	vRB = New ReportBuilder(QueryText);
	vRBSettings = vRB.GetSettings(True, True, True, True, True);
	ReportBuilder.SetSettings(vRBSettings, True, True, True, True, True);

	// Set default report builder header text
	ReportBuilder.HeaderText = NStr("EN='Room inventory';RU='Загрузка номеров';de='Laden von Zimmern'");

	// Fill report builder fields presentations from the report template
	cmFillReportAttributesPresentations(ThisObject);

	// Reset report builder template
	ReportBuilder.Template = Undefined;EndProcedure
